const Message = {
    // Authentication & Authorization Errors
    UNAUTHORIZED: "عه! فکر کردی کی هستی؟ اجازه دسترسی نداری، داداش/آبجی!",
    FORBIDDEN: "نه دیگه، اینجا فقط برای آدمای خاصه. شما تایید نشدی!",

    // Validation Errors
    INVALID_ID: "شناسه‌ت انگار از مریخ اومده، درست وارد کن لطفاً!",
    REQUIRED_FIELDS: "داداش/آبجی، فیلدا رو نصفه وارد نکن. مگه کارو نیمه‌کاره انجام میدی؟",
    INVALID_PRICE: "این قیمت چیه وارد کردی؟ مگه حراجی زدی؟ عدد وارد کن!",
    INVALID_CATEGORY: "دسته‌بندی که وارد کردی رو حتی گوگل هم نمی‌شناسه. یه بار دیگه چک کن!",

    // Database Errors
    NOT_FOUND: "اوپس! مورد نظرت گم شده. شاید پشت مبل باشه؟",
    CATEGORY_NOT_FOUND: "دسته‌بندی مورد نظر نیست! یا شما اشتباه زدی یا ما دسته‌بندی رو قایم کردیم!",
    DUPLICATE_NAME: "اسم تکراری؟ مگه مدرسه‌ست که همه اسمشون 'علی' باشه؟ یه اسم جدید بده!",

    // CRUD Operation Errors
    CREATE_FAILED: "نتونستیم محصول جدید بسازیم. انگار سرور قهر کرده!",
    UPDATE_FAILED: "آپدیت نشد. شاید محصول خودش راضی نیست تغییر کنه!",
    DELETE_FAILED: "این محصول پاک نشد، احتمالاً دلش نمی‌خواد از دیتابیس بره بیرون.",
    HAS_DEPENDENCIES: "حذف نشد، چون زیرشاخه‌هایی داره که گریه‌شون می‌گیره اگر حذف بشه!",

    // General Errors
    SERVER_ERROR: "سرور ترکیده! دوباره امتحان کن یا یه چای بخور تا درستش کنیم.",
    BAD_REQUEST: "درخواست اشتباهه! انگار با پا تایپ کردی؟ یه نگاه بنداز دوباره.",
    UNKNOWN_ERROR: "یه خطای عجیب و غریب رخ داده. شاید کار گربه همسایه باشه؟",

    // Success Messages
    DISPLAY_SUCCESS: "محصولات با موفقیت پیدا شدن! حالا بیا ببینیم چی داریم اینجا!",
    CREATE_SUCCESS: "محصول جدید با موفقیت ساخته شد! دستت درد نکنه.",
    UPDATE_SUCCESS: "محصول با موفقیت به‌روزرسانی شد. کارت عالی بود!",
    DELETE_SUCCESS: "محصول حذف شد. دیتابیس هم از دستش راحت شد!",
    EMPTY_PRODUCT: "انگار ادمین یادش رفته محصول اضافه کنه ",

    // New Messages for User
    INVALID_EMAIL: "ایمیلت درست نیست، مگه داری رمز مخفی می‌فرستی؟",
    INVALID_PASSWORD: "پسورد باید استاندارد باشه، مثلاً حداقل 8 کاراکتر داشته باشه!",
    USER_NOT_FOUND: "کاربر مورد نظر پیدا نشد. شاید باید تو فضا دنبالش بگردیم؟",
    DUPLICATE_EMAIL: "این ایمیل قبلاً ثبت شده. ایمیل دیگه‌ای وارد کن!",
    DUPLICATE_USERNAME: "نام کاربری تکراریه. اینجا هرکسی یکتا باید باشه!",
    REGISTER_SUCCESS: "کاربر با موفقیت ثبت‌نام کرد! خوش اومدی به دنیای ما.",
    LOGIN_SUCCESS: "با موفقیت لاگین کردی. خوش اومدی!",
    LOGOUT_SUCCESS: "با موفقیت لاگ‌اوت کردی. تا بعد!",

    INVALID_INPUT: "داده‌های ورودی نامعتبره. انگار سرور قهر کرده!",
};

module.exports = {
    Message,
};
